#pragma once
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <locale.h>
#define SLASH puts("///////////////////////////////////////")
#define TIRE puts("---------------------------------------------------------------------------------------")
#define N 30
#define E 7
#define ERROR printf("Файл не был открыт!\n"); exit(1)
/*
Домашня бібліотека.

//Є інформація:
//+автора книги
//+назву книги
//+розділ, до якого належить література даного виду(фантастика, пригоди, наукова, кулінарія тощо)
//+місце, де стоїть книга
//+чи знаходиться книга вдома.
//+Якщо книга була комусь позичена, то слід передбачити поле, де буде вказано прізвище позичальника.


//Для перегляду книг слід передбачити їх сортування за вибором ;
//- за прізвищем автора
//-за назвою книги.


//Пошук слід здійснювати
//-за прізвищем автора
//-назвою книги (у тому разі і за окремими літерами)
//-за видом.
//Обробити ситуацію, коли під час пошуку за введеними даними нічого не знайдено.


Передбачити ситуацію, коли позичена книга буде повернута або книгу побажають позичити.
*/
typedef struct {
	char autor[N];
	char nazva[N];
	char rozdil[N];
	int nomer_mesta;
	int vdoma;
	char prizvische_pozik[N];
} Book;
